{
  "header": {
    "home": "Home",
    "about": "About YKD",
    "study_abroad": "HK/Macau Study",
    "immigration": "Immigration",
    "rankings": "HK University Rankings",
    "contact": "Contact Us"
  },
  "footer": {
    "quote": "\"Start Your Journey to World-Class Universities\"",
    "tagline": "Ascent Excellence, Lasting Achievement",
    "contact_us": "Contact Us",
    "address_label": "Address:",
    "phone_label": "Phone:",
    "email_label": "Email:",
    "address": "Room 1903, Block A, Bojin International, No.1 Tai Ran 7th Road, Futian District, Shenzhen, Guangdong, China",
    "phone": "+86-19907695745",
    "email": "info@saterh.cn",
    "message_title": "Send Us a Message",
    "message_description": "If you have any questions about our services or need assistance, please feel free to contact us via the link below.",
    "send_email": "Click to Email Us",
    "copyright": "© 2025 YKD GLOBAL CO. LTD All Rights Reserved"
  },
  "home": {
    "title": "YKD GLOBAL - Start Your Journey to World-Class Universities",
    "hero_title": "YKD GLOBAL<br />",
    "hero_subtitle": "Ascend. Achieve.<br />World-Class Education.",
    "testimonial_quote": "Start Your Journey to World-Class Universities",
    "testimonial_author": "YKD GLOBAL",
    "about_title": "About Us",
    "about_description": "Founded in 2005 by a group of financial, tax, and education industry elites with years of experience. We specialize in providing one-stop professional and personalized services, serving over 500 high-net-worth clients with excellent service over the past decade. Our expertise includes asset management, identity planning, and educational planning, with first-hand project resources in Hong Kong, Singapore, Europe, and Southeast Asia.",
    "featured_title": "Why Choose Us?",
    "feature1_title": "Admission List",
    "feature1_desc": "YKD GLOBAL Secures Offers from World-Class Universities in 2024",
    "feature2_title": "Service Process",
    "feature2_desc": "Personalized One-Stop Study Abroad Planning",
    "feature3_title": "Study Abroad Programs",
    "feature3_desc": "YKD GLOBAL Wishes You Success in Your Dream School",
    "feature4_title": "Hong Kong Universities Overview",
    "feature4_desc": "Comprehensive Guide to Prestigious Programs",
    "read_more": "Read More"
  },
  "study_abroad": {
    "title": "Study in Hong Kong - YKD GLOBAL",
    "program_title": "Study Abroad Programs",
    "associate_degree": "Hong Kong Associate Degree",
    "bachelor_degree": "Hong Kong Bachelor's Degree",
    "master_degree": "Hong Kong Master's Degree",
    "advantages_title": "Advantages of Studying in Hong Kong",
    "advantages_description": "Level of Development: Hong Kong ranks 7th in Global City Comprehensive Competitiveness Ranking. Study Abroad Reputation: Hong Kong ranks 22nd in Best Student Cities Ranking. Safety Level: Hong Kong ranks 20th in Safest Cities Ranking (1st among Chinese cities) - Safe food, fresh air, clean water.",
    "main_title": "Study in Hong Kong",
    "description": "Based on students' individual situations and needs, we provide language exam training, optimal matching of universities and majors, elite school interview skills coaching, document optimization according to application school characteristics, timely submission and follow-up of applications, professional document writing guidance services, and help students complete information feedback work to achieve admission to elite schools with lower barriers."
  },
  "rankings": {
    "title": "HK University Rankings - YKD GLOBAL",
    "qs_title": "What is QS University Ranking?",
    "qs_description": "QS World University Rankings is a world-recognized authoritative ranking produced and published by QS UK, covering comprehensive world universities and subject rankings.",
    "hk_changes_title": "Changes in HK University Rankings",
    "hk_changes_description": "Hong Kong universities showed outstanding performance in this year's rankings. Among the 7 listed institutions, as high as 86% of universities showed significant improvements, demonstrating an overall enhancement in regional higher education strength. This upward trend fully reflects the continuous improvement of Hong Kong universities in educational quality and international competitiveness.",
    "top3_title": "HK Universities Overview TOP3",
    "hku_title": "University of Hong Kong (HKU)",
    "hku_description": "Established in 1911, this is a public research university located in the Hong Kong Special Administrative Region of China, excelling in fields such as medicine, business, humanities, and law. The University of Hong Kong ranks 1st among Hong Kong universities. Key majors: Business Administration, Finance, Linguistics, Law, Journalism, Education, Medicine, etc. Domestic comparison: Peking University QS 17, Hong Kong Top 8, Asia Third.",
    "cuhk_title": "The Chinese University of Hong Kong (CUHK)",
    "cuhk_description": "Established in 1984, located at Tat Chee Avenue in Kowloon Tong, with faculties including Business, Humanities and Social Science, Science and Engineering, Creative Media, and Law; the school motto is 'Through Learning and to Serve'. Hong Kong University Rankings: The Chinese University of Hong Kong ranks 2nd. Key majors: Finance, Accounting, Law, Business, Psychology, Electronics, Computer Science, etc. Domestic comparison: Renmin University of China, Fudan University QS 36, Hong Kong Top 8, Asia Sixth.",
    "hkust_title": "Hong Kong University of Science and Technology (HKUST)",
    "hkust_description": "Established in 1986, located in Clear Water Bay, Kowloon, it is one of the 8 government-funded higher education institutions in Hong Kong. HKUST offers interdisciplinary courses in science, engineering, business management, humanities, and social sciences, with Electronic Engineering, Civil Engineering, Computer Science, and Statistics as its key disciplines. Hong Kong University Rankings: Hong Kong University of Science and Technology ranks 3rd. Key majors: Civil, Mechanical, Chemical, Electronic, Economics, etc. Domestic comparison: Tsinghua University QS 47, Hong Kong Top 8, Asia Eleventh.",
    "read_more": "Read More"
  },
  "about": {
    "title": "About Us - YKD GLOBAL",
    "heading": "About YKD GLOBAL",
    "company_intro_title": "Company Introduction",
    "company_intro": "YKD GLOBAL is committed to providing efficient and secure international identity planning and cross-border living solutions. The company focuses on core areas such as overseas education, global asset allocation, business expansion, and diversified identity acquisition, offering customers rich and personalized choices. With a professional global team and strict risk control, YKD GLOBAL continuously optimizes service experience to help clients achieve a seamless vision of international life.",
    "education_planning_title": "Education Planning",
    "education_planning": "Our education expert team has extensive experience and expertise, customizing education planning solutions based on individual interests, talents, goals, and budgets. We provide comprehensive consultation and guidance on school and major selection, entrance exam preparation, extracurricular activities, and social practice planning. We help students enter their dream schools smoothly and lay a solid foundation for their future development. Our success rate for admission to top 100 global universities exceeds 90%, far higher than the international average of less than 20%. This includes prestigious institutions like the UK G5, Hong Kong's top three, and Australia's Group of Eight. The secret lies in customized planning, precise deployment, and comprehensive preparation.",
    "identity_planning_title": "Identity Planning",
    "identity_planning": "In collaboration with domestic and international project partners, we provide comprehensive consultation on second-country residency permits and investment immigration, helping clients achieve success in finance, lifestyle, and the next generation's education and career development through identity planning. We understand that many \"Elite Talent\" applicants currently live and work primarily in mainland China. To meet the renewal needs of these clients, we match them with flexible Hong Kong employment opportunities and address issues such as property purchase in Hong Kong, company establishment, and children's education.",
    "asset_planning_title": "Asset Planning",
    "asset_planning": "Our financial services team has years of investment experience and expertise, helping clients develop offshore asset allocation strategies that suit their needs and goals. Based on factors such as clients' risk tolerance, investment objectives, and time horizons, we customize investment plans and provide ongoing investment management and supervision.",
    "trustworthy": "A Trustworthy Educational Institution",
    "template_credit": "Website Template design by Free Website Templates"
  },
  "immigration": {
    "title": "Service Process - YKD GLOBAL",
    "sidebar_title": "Immigration",
    "sidebar_description": "YKD GLOBAL specializes in solving core study abroad challenges, targeting pain points such as insufficient language scores and complex application processes to select the most suitable services for you.",
    "team_title": "YKD GLOBAL Team Introduction",
    "team_description": "YKD GLOBAL's professional consulting team deeply understands the admission criteria of top global institutions, helping students achieve seamless transition from college entrance exams to overseas elite universities. Through precise background enhancement planning and highly personalized document guidance, they effectively compensate for language score deficiencies, ensuring students don't miss quality educational resources or delay their academic opportunities due to language shortcomings.",
    "main_title": "Service Process",
    "preparation_title": "Preparation Stage",
    "application_service_title": "Application Qualification Acquisition Service",
    "application_service_description": "We will help students enhance their application backgrounds to obtain qualification for applying to Hong Kong elite universities. Background enhancement includes but is not limited to exchange experiences at prestigious universities, internships at renowned companies, international business competitions, volunteer activities, leadership activities, professor recommendation letters, alumni recommendation letters, academic paper publications, and social practice projects and activities.",
    "hk_application_title": "Hong Kong Elite University Application Service",
    "hk_application_description": "We will assist students in organizing their application materials and professionally submit these materials to target institutions. Material preparation includes but is not limited to personal statements, transcripts, recommendation letters, proof of awards inside and outside school, social practice certificates, published paper materials, and international competition awards. Based on student capabilities, we help students select and apply to 4-6 Hong Kong institutions through career assessments, ensuring interview qualifications.",
    "coaching_title": "Coaching Services",
    "interview_coaching_title": "Admission Interview Coaching Service",
    "interview_coaching_description": "We provide students with 4-day, 3-night full English Hong Kong admission interview coaching, including personal material mining, self-introduction preparation, professor mock interviews, authentic interview practice, interview material preparation, English presentations, English speaking, and professional material preparation. We also provide each student with 12 hours of 1-on-1 interview coaching and organize school visits in Hong Kong with admissions officers.",
    "enrollment_title": "Enrollment Stage",
    "preparation_service_title": "Hong Kong Enrollment Preparation Service",
    "preparation_service_description": "We provide incoming high school graduates with a 6-day, 5-night domestic freshman orientation camp during summer vacation. The camp mainly helps students understand university life, cultivate the right learning attitude, learn how to handle relationships with teachers, roommates, classmates, and seniors, and establish a self-management system. This thoroughly and effectively prepares students for university life.",
    "integration_service_title": "Hong Kong Cultural Integration Service",
    "integration_service_description": "We provide students with a 7-day, 6-night Hong Kong student life integration experience during summer vacation, including Hong Kong university learning experiences, internships at Fortune 500 companies in Hong Kong, Hong Kong lifestyle experiences, international perspectives, and global financial center experiences. During their first two years of university, we will also provide students with Cantonese learning support, IELTS exam support, and local circle integration service support."
  },
  "contact": {
    "title": "Contact Us - YKD GLOBAL",
    "contact_info": "Contact Information",
    "company_name": "Shenzhen YKD GLOBAL Technology Co., Ltd.",
    "address": "Room 1903, Block A, Bojin International, No.1 Tai Ran 7th Road, Futian District, Shenzhen, Guangdong, China",
    "phone_label": "Phone:",
    "phone": "+86-19907695745",
    "wechat_label": "WeChat:",
    "wechat": "YKD_global",
    "email_label": "Email:",
    "email": "info@saterh.cn",
    "quick_message_title": "Send Quick Message",
    "quick_message_desc": "If you have any questions or need consultation, please fill out the form below and we will reply as soon as possible.",
    "name_label": "Name",
    "phone_input_label": "Phone Number",
    "email_input_label": "Email Address",
    "message_label": "Message Content",
    "send_button": "Send Message"
  }
}